---
type: ComponentRepeaterSlot
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ComponentRepeaterSlot

`Autodesk.Revit.DB.ComponentRepeaterSlot` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsTypeValidForSlot | 2014 | `public bool IsTypeValidForSlot ( ElementId typeId )` |
| Method | MakeDefault | 2014 | `public void MakeDefault ()` |
| Method | MakeEmpty | 2014 | `public void MakeEmpty ()` |
| Property | FamilyType | 2014 | `public ElementId FamilyType { get ; set ; }` |
| Property | IsDefault | 2014 | `public bool IsDefault { get ; }` |
| Property | IsEmpty | 2014 | `public bool IsEmpty { get ; }` |
| Property | Parameter | — | `` |